Soviana_200601110111_Kelas F_Catatan Pandas

# Pandas

• Pandas adalah sebuah librari berlisensi BSD dan open source yang menyediakan struktur data dan analisis data yang mudah digunakan dan berkinerja tinggi untuk bahasa pemrograman Python.

• Librari analisis data yang memiliki struktur data yang diperlukan untuk mengkonversi data mentah ke dalam bentuk/format tabel sehingga memudahkan untuk analisis.

# Data Frame
• Struktur data dasar pandas dinamakan DataFrame.

• Koleksi kolom berurutan dengan bentuk sebuah tabel yang tampak seperti database dimana sebuah baris tunggal mewakili sebuah data tunggal dan kolom mewakili atribut tertentu.

• Dengan adanya fitur dataframe memudahkan untuk membaca sebuah file dan menjadikannya table.

# Apa yang bisa dilakukan Pandas?
• Read from and write to CSV, other file and databases.

• Calculate statistics and answer questions about the data, likeWhat's the average, median, max, or min of each column?
   
   - Does column A correlate with column B?
   
   - What does the distribution of data in column C look like?
     
• Clean the data by doing things like removing missing values and filtering rows or columns by some criteria Visualize the data with help from Matplotlib. Plot bars, lines, histograms, bubbles, and more.

• Kita juga dapat mengolah data dengan menggunakan operasi seperti join, distinct, group by, agregasi, dan teknik lainnya yang terdapat pada SQL.

# Install dan Import
• Install :
   - conda install pandas
     atau
   - pip install pandas
   
• Jika akan menggunakan di dalam program, perlu dilakukan import:
  - import pandas
  - Atau biasanya untuk menyingkat penulisan saat diakses, maka diberi nama alias, misalnya "pd"
  - import pandas as pd

# Komponen Utama Pandas
•Series dan Dataframe
  - Series adalah suatu kolom
  - Dataframe adalah kumpulan series, dapat berupa tabel multidimensi

# Pembuatan dataframe
•Dataframe dapat terbentuk berasal dari hasil pembacaan data atau bisa juga dibuat sendiri (created from the scratch).

•Banyak cara untuk membuat dataframe, cara paling sederhana adalah dengan menggunakan struktur data dict dalam python
Contoh :
 - Misal akan dibuat dataframe penjualan apple dan orange.
 - Kolom berisi jenis buah, sedangkan setiap baris berisi besarnya penjualan.

# Fungsi Lain
•df.head() → pengambilan 5 data pertama

•df.head(10)→ pengambilan 10 data pertama

• df tail (8) → pengambilan 8 data terakhir

• df.columns → menampilkan nama kolom

• df[['nama', 'alamat']] → pilih kolom tertentu

Mengacu ke data sebelumnya :
 •purchases["oranges"].min()→ data terkecil
 
 •purchases["oranges"].max) → data terbesar
 
 •purchases["oranges"].mean() → rata-rata
 
 •purchases["oranges"].sum()→ jumlah
 
 •purchases["oranges"].count()→ cacah
 
 •purchases [purchases['oranges'] == 3] → filter data

# Untuk lebih jelasnya akan dilakukan percobaan sebagai berikut:

Pandas merupakan salah satu package yang sangat membantu kita dalam pengolahan data dengan bahasa python. Hal ini karena pada menyediakan fitur dataframe. Dengan dataframe, kita bisa menjadikan file terbaca menjadi sebuah tabel. File yang didukung seperti .txt, .csv, .tsv dan lainnya.

# Mengimpor Pandas

In [1]:
import pandas as pd

# Import .txt

Siapkan dahulu file txt (dengan jarak antar data misal menggunakan tab) di folder yang sama dengan program.

In [2]:
data1=pd.read_csv("data.txt")
print(data1)

   A\tB
0  1\t2
1  4\t3
2  4\t2

In [3]:
data2=pd.read_csv("data.txt", delimiter="\t")
print(data2)

   A  B
0  1  2
1  4  3
2  4  2

# Import .csv

Siapkan dahulu file csv di folder yang sama dengan program.

In [4]:
data3=pd.read_csv("data.txt")
print(data3)

   A\tB
0  1\t2
1  4\t3
2  4\t2

In [5]:
data4=pd.read_csv("data.txt", delimiter="\s+")
print(data4)

   A  B
0  1  2
1  4  3
2  4  2

# Import .xlsx

Siapkan dahulu file xlsx di folder yang sama dengan program.

In [ ]:
data5=pd.read_excel('data.xlsx')
print(data5)

# Import .xls

Siapkan dahulu file xls di folder yang sama dengan program.

In [ ]:
data6=pd.read_excel('data.xls')
print(data6)

# Melihat Tabel

In [6]:
#semua
data2

   A  B
0  1  2
1  4  3
2  4  2

In [7]:
#sebagian yang diatas (karena datanya sedikit maka yang tampil semua, silahkan coba dengan data yang lebih banyak lagi sendiri)
data2.head()

   A  B
0  1  2
1  4  3
2  4  2

# Membuat Dataframe sendiri

In [8]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [9]:
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [10]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

Setelah pada pertemuan sebelumnya kita membahas bagaimana membuat dataframe, kali ini kita akan membahas lebih lanjut terkait apa saja yang dapat kita lakukan dengan dataframe. Tapi sebelumnya kita import pandas dahulu sebagai pd dan numpy sebagai np

In [11]:
import pandas as pd
import numpy as np

# Memanggil data tertentu pada dataframe

Misal kita punya dataframe sebagai berikut:

In [12]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

Dan ingin memanggil kolom tertentu

In [13]:
df2["Nama"]

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

In [14]:
df2["Usia"]

0    32
1    43
2    55
Name: Usia, dtype: int64

In [15]:
df2["Nama"][0]

'Purwanto'

In [16]:
df2.iloc[0][0]

'Purwanto'

In [17]:
df2.loc[0]["Nama"]

'Purwanto'

In [18]:
df2.at[0,"Nama"]

'Purwanto'

In [19]:
df2.iat[0,0]

'Purwanto'

In [20]:
df2.iloc[0]

Nama    Purwanto
Usia          32
Name: 0, dtype: object

In [21]:
df2.loc[:,'Nama']

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

# Set Index

In [22]:
df3 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df3

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [23]:
df3.set_index("Nama")

          Usia
Nama
Purwanto    32
Purnomo     43
Purwo       55

# Pemanggilan Baris

In [24]:
df4 = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [25]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [26]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

# Menambah Kolom

In [27]:
#Menambahkan index di kolom baru
df5 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5

       Nama  Usia  Index
0  Purwanto    32      0
1   Purnomo    43      1
2     Purwo    55      2

In [28]:
#Menambahkan kolom dengan isian baru
df5.loc[:, "Gender"] = pd.Series(['L','L','L'])
df5

       Nama  Usia  Index Gender
0  Purwanto    32      0      L
1   Purnomo    43      1      L
2     Purwo    55      2      L

# Melihat ukuran dataframe

In [29]:
#ukuran baris paling panjang
len(df2)

3

In [30]:
#ukuran baris pada kolom tertentu
len(df2["Nama"])

3

In [31]:
#ukuran baris, ukuran kolom dataframe
print(df2.shape)

(3, 2)

# Menghapus

In [32]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [33]:
#menghapus kolom
del df6['Nama']
df6

   Usia
0    32
1    43
2    55

In [34]:
#Menghapus n baris di awal
df6=df6[2:]
df6

   Usia
2    55

In [35]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [36]:
#Menghapus baris tertentu
df6=df6.drop(df6.index[[0,2]])
df6

      Nama  Usia
1  Purnomo    43

# Ekspor Dataframe

In [ ]:
#import pandas dan numpy
import pandas as pd
import numpy as np
#Misal kita punya suatu dataframe
data = [[1,32],[2,43],[4,55]]
df = pd.DataFrame(data,columns=['Nama','Usia'])
#Convert ke numpy array
databaru = df.to_numpy()
print(databaru)
#Convert ke txt
df.to_csv("dataexport.txt")
#Convert ke csv
df.to_csv("dataexport.csv")
#Convert ke xlsx
writer = pd.ExcelWriter('dataexport.xlsx')
df.to_excel(writer, 'DataFrame')
writer.save()